#### Ordinal Number Encoding

In [2]:
import datetime

In [3]:
today_date= datetime.datetime.today()

In [4]:
today_date

datetime.datetime(2021, 2, 8, 0, 9, 55, 645055)

In [8]:
## list comprehension: to get the previous fifteen days datetime as of today

days = [today_date-datetime.timedelta(x) for x in range (0,15)]

In [10]:
import pandas as pd
df=pd.DataFrame(days)
df.columns = ['Days']

In [11]:
df.head()

                        Days
0 2021-02-08 00:09:55.645055
1 2021-02-07 00:09:55.645055
2 2021-02-06 00:09:55.645055
3 2021-02-05 00:09:55.645055
4 2021-02-04 00:09:55.645055

In [23]:
df['weekday']=df['Days'].dt.weekday

In [24]:
df.head()

                        Days  Weekday  weekday
0 2021-02-08 00:09:55.645055        0        0
1 2021-02-07 00:09:55.645055        6        6
2 2021-02-06 00:09:55.645055        5        5
3 2021-02-05 00:09:55.645055        4        4
4 2021-02-04 00:09:55.645055        3        3

In [28]:
dictionary={1:'Monday',2:'Tuesday',3:'Wednesday',4:'Thursday',5:'Friday',6:'Saturday',0:'Sunday'}

In [29]:
df['weekday_name']=df['weekday'].map(dictionary)

In [30]:
df.head()

                        Days  Weekday  weekday weekday_name
0 2021-02-08 00:09:55.645055        0        0       Sunday
1 2021-02-07 00:09:55.645055        6        6     Saturday
2 2021-02-06 00:09:55.645055        5        5       Friday
3 2021-02-05 00:09:55.645055        4        4     Thursday
4 2021-02-04 00:09:55.645055        3        3    Wednesday

#### Count or Frequency encoding

In [35]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [36]:
columns=[1,3,5,6,7,8,9,13]

In [37]:
train_set=train_set[columns]

In [38]:

train_set.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']

In [39]:
train_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [40]:
for feature in train_set.columns[:]:
    print(feature, ':',len(train_set[feature].unique()), 'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels